Revit 2024 API
Form.GetCurvesAndEdgesReference Method
Given a point, return all edges and curves that it is lying on.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ReferenceArray GetCurvesAndEdgesReference(
	Reference pointReference
)
Visual Basic
Public Function GetCurvesAndEdgesReference ( _
	pointReference As Reference _
) As ReferenceArray
Visual C++
public:
ReferenceArray^ GetCurvesAndEdgesReference(
	Reference^ pointReference
)
Parameters
pointReference
Type: Autodesk.Revit.DB.Reference
The reference of a point.
Return Value
Reference array containing all edges and curves that the point is lying on.
See Also
Form Class
Autodesk.Revit.DB Namespace